load_testing/results_for_report/long_comp/dyn_3_peaks_360s_10keys_3000r.txt
CONNECTED to addr	172.31.11.13:3000
CONNECTED to addr	172.31.10.136:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.11.13:3000
all addrs:
1	172.31.11.13:3000
2	172.31.10.136:3000
thread addr: 172.31.10.136:3000
Running 6m test @ http://172.31.11.13:3000
  2 threads and 200 connections
  Thread calibration: mean lat.: 430.994ms, rate sampling interval: 2281ms
  Thread calibration: mean lat.: 3056.762ms, rate sampling interval: 11706ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    17.21s    13.80s    1.26m    70.04%
    Req/Sec     1.38k   172.64     1.60k    84.07%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.38s 
 75.000%   25.17s 
 90.000%   38.17s 
 99.000%    0.91m 
 99.900%    1.22m 
 99.990%    1.25m 
 99.999%    1.26m 
100.000%    1.26m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.569     0.000000            1         1.00
    2699.263     0.100000        96674         1.11
    5156.863     0.200000       193362         1.25
    7643.135     0.300000       290036         1.43
   10313.727     0.400000       386821         1.67
   13377.535     0.500000       483310         2.00
   15237.119     0.550000       531824         2.22
   17121.279     0.600000       579984         2.50
   19447.807     0.650000       628321         2.86
   22003.711     0.700000       676820         3.33
   25165.823     0.750000       724958         4.00
   26886.143     0.775000       749165         4.44
   28770.303     0.800000       773425         5.00
   30621.695     0.825000       797539         5.71
   32931.839     0.850000       821609         6.67
   35651.583     0.875000       845753         8.00
   36929.535     0.887500       858044         8.89
   38174.719     0.900000       870173        10.00
   39583.743     0.912500       882174        11.43
   41123.839     0.925000       894113        13.33
   42795.007     0.937500       906351        16.00
   43810.815     0.943750       912351        17.78
   44728.319     0.950000       918370        20.00
   45940.735     0.956250       924416        22.86
   47284.223     0.962500       930401        26.67
   48955.391     0.968750       936474        32.00
   49610.751     0.971875       939388        35.56
   50364.415     0.975000       942447        40.00
   51183.615     0.978125       945515        45.71
   52035.583     0.981250       948502        53.33
   52723.711     0.984375       951478        64.00
   53215.231     0.985938       953014        71.11
   53805.055     0.987500       954546        80.00
   54427.647     0.989062       956072        91.43
   55181.311     0.990625       957531       106.67
   56786.943     0.992188       959023       128.00
   58097.663     0.992969       959805       142.22
   58949.631     0.993750       960544       160.00
   60096.511     0.994531       961302       182.86
   60817.407     0.995313       962049       213.33
   65404.927     0.996094       962797       256.00
   66125.823     0.996484       963185       284.44
   66912.255     0.996875       963548       320.00
   68222.975     0.997266       963935       365.71
   68747.263     0.997656       964313       426.67
   69337.087     0.998047       964691       512.00
   69664.767     0.998242       964877       568.89
   69992.447     0.998437       965070       640.00
   70713.343     0.998633       965260       731.43
   72941.567     0.998828       965439       853.33
   73334.783     0.999023       965651      1024.00
   73465.855     0.999121       965742      1137.78
   73596.927     0.999219       965834      1280.00
   73727.999     0.999316       965921      1462.86
   73859.071     0.999414       966007      1706.67
   73990.143     0.999512       966115      2048.00
   74055.679     0.999561       966164      2275.56
   74121.215     0.999609       966211      2560.00
   74186.751     0.999658       966260      2925.71
   74252.287     0.999707       966311      3413.33
   74317.823     0.999756       966346      4096.00
   74383.359     0.999780       966370      4551.11
   74448.895     0.999805       966389      5120.00
   74514.431     0.999829       966408      5851.43
   74711.039     0.999854       966434      6826.67
   74842.111     0.999878       966456      8192.00
   74907.647     0.999890       966465      9102.22
   75038.719     0.999902       966478     10240.00
   75104.255     0.999915       966488     11702.86
   75169.791     0.999927       966500     13653.33
   75235.327     0.999939       966514     16384.00
   75300.863     0.999945       966531     18204.44
   75300.863     0.999951       966531     20480.00
   75300.863     0.999957       966531     23405.71
   75366.399     0.999963       966546     27306.67
   75366.399     0.999969       966546     32768.00
   75366.399     0.999973       966546     36408.89
   75366.399     0.999976       966546     40960.00
   75431.935     0.999979       966554     46811.43
   75431.935     0.999982       966554     54613.33
   75431.935     0.999985       966554     65536.00
   75497.471     0.999986       966563     72817.78
   75497.471     0.999988       966563     81920.00
   75497.471     0.999989       966563     93622.86
   75497.471     0.999991       966563    109226.67
   75497.471     0.999992       966563    131072.00
   75497.471     0.999993       966563    145635.56
   75497.471     0.999994       966563    163840.00
   75497.471     0.999995       966563    187245.71
   75563.007     0.999995       966566    218453.33
   75563.007     0.999996       966566    262144.00
   75563.007     0.999997       966566    291271.11
   75563.007     0.999997       966566    327680.00
   75563.007     0.999997       966566    374491.43
   75563.007     0.999998       966566    436906.67
   75628.543     0.999998       966567    524288.00
   75628.543     0.999998       966567    582542.22
   75628.543     0.999998       966567    655360.00
   75628.543     0.999999       966567    748982.86
   75628.543     0.999999       966567    873813.33
   75694.079     0.999999       966568   1048576.00
   75694.079     1.000000       966568          inf
#[Mean    =    17210.146, StdDeviation   =    13797.181]
#[Max     =    75628.544, Total count    =       966568]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  989187 requests in 6.00m, 241.57MB read
  Non-2xx or 3xx responses: 1770
Requests/sec:   2747.74
Transfer/sec:    687.12KB
thread 0 made 490621 requests and got 490521 responses
thread 1 made 498765 requests and got 498666 responses

2022-06-07 01:52:16.154 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: NaN 
2022-06-07 01:52:21.615 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 2.1744688201761964 
2022-06-07 01:52:26.572 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2284122562674096 
2022-06-07 01:52:31.676 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.19811897843707 
2022-06-07 01:52:36.823 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.185121243035392 
2022-06-07 01:52:41.822 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2014104609184786 
2022-06-07 01:52:46.789 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1959227116423776 
2022-06-07 01:52:51.960 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1880882701890374 
2022-06-07 01:52:56.867 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1906210392902408 
2022-06-07 01:53:01.865 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1749244959595135 
2022-06-07 01:53:06.841 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.147797156971469 
2022-06-07 01:53:11.875 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.188893459481695 
2022-06-07 01:53:16.955 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2263245033112584 
2022-06-07 01:53:21.944 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2218255991840898 
2022-06-07 01:53:26.936 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1999496981891349 
2022-06-07 01:53:31.939 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1725913214023045 
2022-06-07 01:53:36.822 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1731815091774305 
2022-06-07 01:53:41.969 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1687310119186727 
2022-06-07 01:53:46.978 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1704630788485606 
2022-06-07 01:53:51.982 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1940138522427441 
2022-06-07 01:53:56.853 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1668876367252239 
2022-06-07 01:54:02.403 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2156320683588842 
2022-06-07 01:54:07.065 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2038814016172508 
2022-06-07 01:54:11.963 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2225493591963976 
2022-06-07 01:54:16.964 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2143156132272919 
2022-06-07 01:54:21.954 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1918691125433813 
2022-06-07 01:54:26.899 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1935538022494543 
2022-06-07 01:54:31.927 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1844899975302543 
2022-06-07 01:54:36.942 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1494478527607361 
2022-06-07 01:54:42.056 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.4008528784648187 
2022-06-07 01:54:46.932 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 2.0199254587155964 
2022-06-07 01:54:52.036 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 2.0536856745479835 
2022-06-07 01:54:56.670 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3083441981747066 
2022-06-07 01:55:01.919 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.232815089574619 
2022-06-07 01:55:06.614 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2313303230288295 
2022-06-07 01:55:11.616 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.228367103694875 
2022-06-07 01:55:16.686 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2257075471698113 
2022-06-07 01:55:21.818 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.232824729227607 
2022-06-07 01:55:26.674 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.21952213977004 
2022-06-07 01:55:31.658 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2090661976335146 
2022-06-07 01:55:36.675 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2057930390095772 
2022-06-07 01:55:41.751 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.215293475719074 
2022-06-07 01:55:46.777 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2243385400063753 
2022-06-07 01:55:51.713 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2014818355640535 
2022-06-07 01:55:56.696 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2104095698328448 
2022-06-07 01:56:01.727 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.220241884150223 
2022-06-07 01:56:06.912 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3142832439910082 
2022-06-07 01:56:12.021 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2439380423323332 
2022-06-07 01:56:16.834 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2141267123287671 
2022-06-07 01:56:21.958 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.211290855067679 
2022-06-07 01:56:26.836 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2248178849535292 
2022-06-07 01:56:31.986 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1882334029898731 
2022-06-07 01:56:37.065 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2230691908192326 
2022-06-07 01:56:41.964 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2387575731717724 
2022-06-07 01:56:46.840 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.231955688112484 
2022-06-07 01:56:52.048 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.222652468538238 
2022-06-07 01:56:57.015 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2290196078431372 
2022-06-07 01:57:01.786 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.2094922174023985 
2022-06-07 01:57:06.883 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.3697097625329815 
2022-06-07 01:57:11.939 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.5366444579043004 
2022-06-07 01:57:17.065 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.7796854364269419 
2022-06-07 01:57:21.900 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0775265343793263 
2022-06-07 01:57:27.033 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1181190104747047 
2022-06-07 01:57:32.012 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.12432978475406 
2022-06-07 01:57:36.985 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1254836507093542 
2022-06-07 01:57:41.981 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1035657506245742 
2022-06-07 01:57:46.829 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1093916755602988 
2022-06-07 01:57:52.085 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1080627508208685 
2022-06-07 01:57:57.042 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0971189591078068 
2022-06-07 01:58:02.023 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1126463700234193 
2022-06-07 01:58:07.093 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1636939489914986 
2022-06-07 01:58:12.072 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.1373626373626373 
2022-06-07 01:58:16.927 INFO  CONSISTENT_HASHING_MODE=false, Imbalance: 1.0897250361794502